In [2]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\anaconda3\envs\my_asad\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\envs\my_asad\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\envs\my_asad\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---- ----------------------------------- 1.3/11.5 MB 7.5 MB/s eta 0:00:02
   ---------- ----------------------------- 2.9/11.5 MB 7.3 MB/s eta 0:00:02
   --------------- ------------------------ 4.5/11.5 MB 7.5 MB/s eta 0:00:01
   -------------------- ------------------- 5.8/11.5 MB 7.2 MB/s eta 0:00:01
   ----------------------- ---------------- 6.8/11.5 MB 6.6 MB/s eta 0:00:01
   -------------------------- ------------- 7.6/11.5 MB 6.2 MB/s eta 0:00:01
   ------------------------------ --------- 8.7/11.5 MB 6.0 MB/s eta 0:00:01
   ------------------------------ --------- 8.9/11.5 MB 6.0 MB/s eta 0:00:01
   ------------------------------------- -- 10.7/11.5 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.8 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.5 MB 5.8 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 4.8 MB/s eta 0:00:00
Downloading pytz-2025.1-py2.py3-none-any.whl (507 kB)
Downloading tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.1 tzdata-2025.1

In [3]:
import numpy as np
import pandas as pd

In [10]:
from numpy.random import randn

np.random.seed(101)    # seed mean we get the same random number

In [11]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [15]:
type(df['W'])

pandas.core.series.Series

In [17]:
df[['W', 'Z']]

          W         Z
A  0.312745 -1.340208
B -1.079692 -0.108067
C  1.511444 -1.134972
D -0.635792 -0.315900
E  0.008583  0.533221

Creating a new column

In [19]:
df['new'] = df['W'] + df['Y']

In [20]:
df

          W         X         Y         Z       new
A  0.312745  0.555649  0.234393 -1.340208  0.547138
B -1.079692 -0.501881 -0.168145 -0.108067 -1.247837
C  1.511444  0.683461  0.939919 -1.134972  2.451363
D -0.635792  0.025160 -0.273070 -0.315900 -0.908861
E  0.008583  0.205307  1.589176  0.533221  1.597759

Droping the column

In [22]:
df.drop('new', axis=1)

          W         X         Y         Z
A  0.312745  0.555649  0.234393 -1.340208
B -1.079692 -0.501881 -0.168145 -0.108067
C  1.511444  0.683461  0.939919 -1.134972
D -0.635792  0.025160 -0.273070 -0.315900
E  0.008583  0.205307  1.589176  0.533221

In [23]:
df       # this will show col new despite of dropping because here inplace =False by default

          W         X         Y         Z       new
A  0.312745  0.555649  0.234393 -1.340208  0.547138
B -1.079692 -0.501881 -0.168145 -0.108067 -1.247837
C  1.511444  0.683461  0.939919 -1.134972  2.451363
D -0.635792  0.025160 -0.273070 -0.315900 -0.908861
E  0.008583  0.205307  1.589176  0.533221  1.597759

In [24]:
df.drop('new', axis=1, inplace=True)
df

          W         X         Y         Z
A  0.312745  0.555649  0.234393 -1.340208
B -1.079692 -0.501881 -0.168145 -0.108067
C  1.511444  0.683461  0.939919 -1.134972
D -0.635792  0.025160 -0.273070 -0.315900
E  0.008583  0.205307  1.589176  0.533221

In [25]:
df.drop('E')   # droping the row

          W         X         Y         Z
A  0.312745  0.555649  0.234393 -1.340208
B -1.079692 -0.501881 -0.168145 -0.108067
C  1.511444  0.683461  0.939919 -1.134972
D -0.635792  0.025160 -0.273070 -0.315900

In [26]:
df[['Z', 'X']]

          Z         X
A -1.340208  0.555649
B -0.108067 -0.501881
C -1.134972  0.683461
D -0.315900  0.025160
E  0.533221  0.205307

## Rows

In [28]:
df

          W         X         Y         Z
A  0.312745  0.555649  0.234393 -1.340208
B -1.079692 -0.501881 -0.168145 -0.108067
C  1.511444  0.683461  0.939919 -1.134972
D -0.635792  0.025160 -0.273070 -0.315900
E  0.008583  0.205307  1.589176  0.533221

In [31]:
df.loc[['C']]

          W         X         Y         Z
C  1.511444  0.683461  0.939919 -1.134972

In [34]:
df.iloc[[2]]

          W         X         Y         Z
C  1.511444  0.683461  0.939919 -1.134972

Selecting subset of rows and columns

In [37]:
df.loc['B', 'Y']

-0.16814492294952013

In [38]:
df.loc[['A', 'B'] , ['W', 'Y']]

          W         Y
A  0.312745  0.234393
B -1.079692 -0.168145